import 'package:flutter/material.dart';
import '../../../../core/utils/theme/custom_app_font_styles.dart';
import '../../../widgets/custom_app_bar.dart';

class TermsAndConditions extends StatelessWidget {
  const TermsAndConditions({super.key, this.isStore = false});
  final bool isStore;
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: MyCustomAppBar(
        enableButtomDivider: true,
        enableLeading: true,
        title: isStore
            ? "شروط فتح متجر أو عيادة بيطرية افتراضية داخل تطبيق MyPet"
            : 'شروط استخدام تطبيق MyPet للمستخدمين  ',
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(16.0),
          child: Text(
            isStore ? longTermsAndConditionsStore : longTermsAndConditionsUser,
            style: CustomAppFontStyle.regular16,
          ),
        ),
      ),
    );
  }
}

/// You can use a [String] variable to store large text content.
/// Dart's String can handle very large text (well over 2000 words).
/// Example:
const String longTermsAndConditionsUser = '''
1. يجب على المستخدم تقديم معلومات حقيقية وصحيحة عند إنشاء الحساب.
2. يتعهد المستخدم باستخدام التطبيق بشكل قانوني وأخلاقي، ويمتنع عن نشر أو عرض أي محتوى مخالف لقوانين جمهورية العراق أو لقيم المجتمع.
3. يُمنع بيع أو شراء الحيوانات الممنوعة قانونًا أو المهددة بالانقراض.
4. يُشترط أن تكون الحيوانات المعروضة بصحة جيدة، مع تقديم معلومات دقيقة عنها.
5. يُمنع عرض أي حيوان بطريقة مؤذية أو مهينة.
6. يجب تقديم تفاصيل واضحة عن الحيوان المفقود وصورة حديثة إن أمكن.
7. تقتصر خدمة الهوية الافتراضية على الحيوانات المملوكة فعليًا للمستخدم.
8. يُمنع استخدام صور من الإنترنت أو صور لحيوانات لا يملكها المستخدم.
9. احترام مواعيد العمل وقوانين الحجز أو الشراء من المتاجر والعيادات البيطرية.
10. في حال وجود شكوى أو خلل في الخدمة، يجب التبليغ عبر أدوات الدعم داخل التطبيق.
11. إدارة التطبيق غير مسؤولة عن أي تعاملات مالية أو اتفاقات تتم خارج حدود المنصة.
12. يُشجّع المستخدمون على التحقق من المعلومات والتواصل بحذر مع الأطراف الأخرى.
13. يُمنع استخدام بيانات مستخدمين آخرين لأي غرض دون موافقتهم.
14. كل البيانات التي يقدمها المستخدم ستُعامل بسرية وفق سياسة الخصوصية المعتمدة.
15. يحق لإدارة التطبيق إيقاف حساب أي مستخدم خالف الشروط دون إشعار مسبق.
16. يمكن للمستخدم حذف حسابه في أي وقت من خلال الإعدادات.
''';
const String longTermsAndConditionsStore = '''
1.     يجب أن يكون لدى المتجر او العيادة البيطرية رخصة مزاولة مهنة رسمية صادرة من الجهات المختصة في العراق، وأن تكون سارية المفعول.
2.     يجب أن يكون للمتجر او العيادة البيطرية موقع فعلي معروف ومسجل داخل العراق، ويُفضل وجوده في خرائط Google أو أي خدمة تحديد مواقع إلكترونية.
3.     يتعهد مقدم الطلب بتقديم معلومات دقيقة وصحيحة عن خدماته، مواعيد العمل، الأسعار، ومواقع الفروع، مع تحديثها بشكل دوري عند الحاجة.
4.     يجب على مقدم الطلب أن يلتزم بالشفافية التامة في الأسعار، العروض، وتوفر المنتجات أو الأدوية.
5.     يلتزم صاحب المتجر أو العيادة بتحديث المعلومات (الأسعار، العنوان، أوقات العمل، الخدمات...) بشكل دوري.
6.     يجب الالتزام بتقديم خدمات ذات جودة عالية للمستخدمين وفق المعايير المهنية والأخلاقية، وتجنب أي ممارسات تجارية مضللة أو استغلالية.
7.     يُمنع استخدام الخدمة لأي نشاط غير مرتبط بالحيوانات الأليفة أو الخدمات البيطرية.
8.     يتحمل صاحب المتجر أو العيادة البيطرية المسؤولية الكاملة عن جودة المنتجات أو دقة الاستشارات الطبية المقدّمة.
9.     يجب توفير وسيلة اتصال فعالة (رقم هاتف، واتساب، بريد إلكتروني) للتواصل مع الزبائن واستقبال استفساراتهم وشكاواهم.
10.  يُمنع استخدام صور مزيفة أو مسروقة أو مضللة داخل الملف التعريفي الافتراضي. ويحق لإدارة التطبيق طلب إثبات صحة أي صورة عند الحاجة.
11.  يُمنع استخدام أسماء وهمية أو تقديم معلومات مضللة عن المتجر او العيادة البيطرية.
12.  تحتفظ إدارة تطبيق MyPet بحق مراجعة وتقييم أداء المتجر أو العيادة البيطرية بناءً على تقييمات المستخدمين، ويمكن حجب الواجهة الافتراضية مؤقتاً أو دائماً في حال وجود شكاوى متكررة أو مخالفات مثبتة.
13.  يمكن إيقاف الحساب دون إشعار مسبق في حال تم استخدامه لأغراض غير قانونية أو غير أخلاقية.
14.  يحق للمستخدمين تقييم المتجر أو العيادة بعد تجربة الخدمة.
15.  يُمنع التلاعب بالتقييمات أو إنشاء تقييمات مزيفة، وسيؤدي ذلك إلى الحظر.
16.  يُمنع نشر إعلانات تجارية أو عروض ترويجية دون الحصول على موافقة إدارة التطبيق.
17.  يُحظر جمع أو استخدام بيانات مستخدمي التطبيق لأي أغراض تسويقية دون موافقتهم الصريحة، ويجب احترام خصوصيتهم بشكل كامل.
18.  يجب أن تكون أي عروض أو إعلانات ضمن الصفحة الافتراضية حقيقية، ويجب الالتزام بها عند الطلب أو الحجز من قبل المستخدمين.
19.  يحق لإدارة التطبيق إيقاف أو تعليق المتجر أو العيادة الافتراضية دون إشعار مسبق في حال مخالفة الشروط أو الإضرار بسمعة التطبيق أو مستخدميه.
20.  إن تقديم طلب لفتح متجر أو عيادة بيطرية افتراضية يُعد قبولاً ضمنيًا بهذه الشروط.
21.  قد يتم تحديث الشروط من وقت لآخر، وسيتم إخطار أصحاب المتاجر/العيادات بالتعديلات عبر التطبيق.
''';
